Microchip-MPLAB-Harmony/csp/apps/dac/dac_wav_gen/firmware/src/packs/ATSAML10E16A_DFP/component/dib.h
/**
 * \brief Component description for DIB
 *
 * © 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-05-31T10:20:47Z */
#ifndef _SAML10_DIB_COMPONENT_H_
#define _SAML10_DIB_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DIB                                          */
/* ************************************************************************** */

/* -------- DIB_DLAR : (DIB Offset: 0x00) ( /W 32) SCS Software Lock Access Register -------- */
#define DIB_DLAR_KEY_Pos                      _U_(0)                                         /**< (DIB_DLAR) Lock access control Position */
#define DIB_DLAR_KEY_Msk                      (_U_(0xFFFFFFFF) << DIB_DLAR_KEY_Pos)          /**< (DIB_DLAR) Lock access control Mask */
#define DIB_DLAR_KEY(value)                   (DIB_DLAR_KEY_Msk & ((value) << DIB_DLAR_KEY_Pos))
#define   DIB_DLAR_KEY_UNLOCK_Val             _U_(0xC5ACCE55)                                /**< (DIB_DLAR) Unlock key value  */
#define DIB_DLAR_KEY_UNLOCK                   (DIB_DLAR_KEY_UNLOCK_Val << DIB_DLAR_KEY_Pos)  /**< (DIB_DLAR) Unlock key value Position  */
#define DIB_DLAR_Msk                          _U_(0xFFFFFFFF)                                /**< (DIB_DLAR) Register Mask  */


/* -------- DIB_DLSR : (DIB Offset: 0x04) ( R/ 32) SCS Software Lock Status Register -------- */
#define DIB_DLSR_SLI_Pos                      _U_(0)                                         /**< (DIB_DLSR) Software Lock implemented Position */
#define DIB_DLSR_SLI_Msk                      (_U_(0x1) << DIB_DLSR_SLI_Pos)                 /**< (DIB_DLSR) Software Lock implemented Mask */
#define DIB_DLSR_SLK_Pos                      _U_(1)                                         /**< (DIB_DLSR) Software Lock status Position */
#define DIB_DLSR_SLK_Msk                      (_U_(0x1) << DIB_DLSR_SLK_Pos)                 /**< (DIB_DLSR) Software Lock status Mask */
#define DIB_DLSR_nTT_Pos                      _U_(2)                                         /**< (DIB_DLSR) Not thirty-two bit Position */
#define DIB_DLSR_nTT_Msk                      (_U_(0x1) << DIB_DLSR_nTT_Pos)                 /**< (DIB_DLSR) Not thirty-two bit Mask */
#define DIB_DLSR_Msk                          _U_(0x00000007)                                /**< (DIB_DLSR) Register Mask  */


/* -------- DIB_DAUTHSTATUS : (DIB Offset: 0x08) ( R/ 32) Debug Authentication Status Register -------- */
#define DIB_DAUTHSTATUS_SID_Pos               _U_(4)                                         /**< (DIB_DAUTHSTATUS)  Position */
#define DIB_DAUTHSTATUS_SID_Msk               (_U_(0x3) << DIB_DAUTHSTATUS_SID_Pos)          /**< (DIB_DAUTHSTATUS)  Mask */
#define DIB_DAUTHSTATUS_SID(value)            (DIB_DAUTHSTATUS_SID_Msk & ((value) << DIB_DAUTHSTATUS_SID_Pos))
#define   DIB_DAUTHSTATUS_SID_NOSEC_Val       _U_(0x0)                                       /**< (DIB_DAUTHSTATUS) Security Extension not implemented  */
#define   DIB_DAUTHSTATUS_SID_NO_Val          _U_(0x2)                                       /**< (DIB_DAUTHSTATUS) Secure invasive debug prohibited  */
#define   DIB_DAUTHSTATUS_SID_YES_Val         _U_(0x3)                                       /**< (DIB_DAUTHSTATUS) Secure invasive debug allowed  */
#define DIB_DAUTHSTATUS_SID_NOSEC             (DIB_DAUTHSTATUS_SID_NOSEC_Val << DIB_DAUTHSTATUS_SID_Pos) /**< (DIB_DAUTHSTATUS) Security Extension not implemented Position  */
#define DIB_DAUTHSTATUS_SID_NO                (DIB_DAUTHSTATUS_SID_NO_Val << DIB_DAUTHSTATUS_SID_Pos) /**< (DIB_DAUTHSTATUS) Secure invasive debug prohibited Position  */
#define DIB_DAUTHSTATUS_SID_YES               (DIB_DAUTHSTATUS_SID_YES_Val << DIB_DAUTHSTATUS_SID_Pos) /**< (DIB_DAUTHSTATUS) Secure invasive debug allowed Position  */
#define DIB_DAUTHSTATUS_SNID_Pos              _U_(6)                                         /**< (DIB_DAUTHSTATUS)  Position */
#define DIB_DAUTHSTATUS_SNID_Msk              (_U_(0x3) << DIB_DAUTHSTATUS_SNID_Pos)         /**< (DIB_DAUTHSTATUS)  Mask */
#define DIB_DAUTHSTATUS_SNID(value)           (DIB_DAUTHSTATUS_SNID_Msk & ((value) << DIB_DAUTHSTATUS_SNID_Pos))
#define   DIB_DAUTHSTATUS_SNID_NOSEC_Val      _U_(0x0)                                       /**< (DIB_DAUTHSTATUS) Security Extension not implemented  */
#define   DIB_DAUTHSTATUS_SNID_NO_Val         _U_(0x2)                                       /**< (DIB_DAUTHSTATUS) Secure non-invasive debug prohibited  */
#define   DIB_DAUTHSTATUS_SNID_YES_Val        _U_(0x3)                                       /**< (DIB_DAUTHSTATUS) Secure non-invasive debug allowed  */
#define DIB_DAUTHSTATUS_SNID_NOSEC            (DIB_DAUTHSTATUS_SNID_NOSEC_Val << DIB_DAUTHSTATUS_SNID_Pos) /**< (DIB_DAUTHSTATUS) Security Extension not implemented Position  */
#define DIB_DAUTHSTATUS_SNID_NO               (DIB_DAUTHSTATUS_SNID_NO_Val << DIB_DAUTHSTATUS_SNID_Pos) /**< (DIB_DAUTHSTATUS) Secure non-invasive debug prohibited Position  */
#define DIB_DAUTHSTATUS_SNID_YES              (DIB_DAUTHSTATUS_SNID_YES_Val << DIB_DAUTHSTATUS_SNID_Pos) /**< (DIB_DAUTHSTATUS) Secure non-invasive debug allowed Position  */
#define DIB_DAUTHSTATUS_Msk                   _U_(0x000000F0)                                /**< (DIB_DAUTHSTATUS) Register Mask  */


/* -------- DIB_DDEVARCH : (DIB Offset: 0x0C) ( R/ 32) SCS Device Architecture Register -------- */
#define DIB_DDEVARCH_RESETVALUE             _U_(0x47702A04)                               /**<  (DIB_DDEVARCH) SCS Device Architecture Register  Reset Value */

