Microchip-MPLAB-Harmony/csp/apps/dac/dac_wav_gen/firmware/src/packs/ATSAML10E16A_DFP/component/dib.h
#define DIB_DDEVARCH_ARCHPART_Pos             _U_(0)                                         /**< (DIB_DDEVARCH) Architecture Part Position */
#define DIB_DDEVARCH_ARCHPART_Msk             (_U_(0xFFF) << DIB_DDEVARCH_ARCHPART_Pos)      /**< (DIB_DDEVARCH) Architecture Part Mask */
#define DIB_DDEVARCH_ARCHPART(value)          (DIB_DDEVARCH_ARCHPART_Msk & ((value) << DIB_DDEVARCH_ARCHPART_Pos))
#define DIB_DDEVARCH_ARCHVER_Pos              _U_(12)                                        /**< (DIB_DDEVARCH) Architecture Version Position */
#define DIB_DDEVARCH_ARCHVER_Msk              (_U_(0xF) << DIB_DDEVARCH_ARCHVER_Pos)         /**< (DIB_DDEVARCH) Architecture Version Mask */
#define DIB_DDEVARCH_ARCHVER(value)           (DIB_DDEVARCH_ARCHVER_Msk & ((value) << DIB_DDEVARCH_ARCHVER_Pos))
#define DIB_DDEVARCH_REVISION_Pos             _U_(16)                                        /**< (DIB_DDEVARCH) Revision Position */
#define DIB_DDEVARCH_REVISION_Msk             (_U_(0xF) << DIB_DDEVARCH_REVISION_Pos)        /**< (DIB_DDEVARCH) Revision Mask */
#define DIB_DDEVARCH_REVISION(value)          (DIB_DDEVARCH_REVISION_Msk & ((value) << DIB_DDEVARCH_REVISION_Pos))
#define DIB_DDEVARCH_PRESENT_Pos              _U_(20)                                        /**< (DIB_DDEVARCH) DEVARCH Present Position */
#define DIB_DDEVARCH_PRESENT_Msk              (_U_(0x1) << DIB_DDEVARCH_PRESENT_Pos)         /**< (DIB_DDEVARCH) DEVARCH Present Mask */
#define DIB_DDEVARCH_ARCHITECT_Pos            _U_(21)                                        /**< (DIB_DDEVARCH) Architect Position */
#define DIB_DDEVARCH_ARCHITECT_Msk            (_U_(0x7FF) << DIB_DDEVARCH_ARCHITECT_Pos)     /**< (DIB_DDEVARCH) Architect Mask */
#define DIB_DDEVARCH_ARCHITECT(value)         (DIB_DDEVARCH_ARCHITECT_Msk & ((value) << DIB_DDEVARCH_ARCHITECT_Pos))
#define DIB_DDEVARCH_Msk                      _U_(0xFFFFFFFF)                                /**< (DIB_DDEVARCH) Register Mask  */


/* -------- DIB_DDEVTYPE : (DIB Offset: 0x1C) ( R/ 32) SCS Device Type Register -------- */
#define DIB_DDEVTYPE_RESETVALUE             _U_(0x00)                                     /**<  (DIB_DDEVTYPE) SCS Device Type Register  Reset Value */

#define DIB_DDEVTYPE_MAJOR_Pos                _U_(0)                                         /**< (DIB_DDEVTYPE) Major type Position */
#define DIB_DDEVTYPE_MAJOR_Msk                (_U_(0xF) << DIB_DDEVTYPE_MAJOR_Pos)           /**< (DIB_DDEVTYPE) Major type Mask */
#define DIB_DDEVTYPE_MAJOR(value)             (DIB_DDEVTYPE_MAJOR_Msk & ((value) << DIB_DDEVTYPE_MAJOR_Pos))
#define DIB_DDEVTYPE_SUB_Pos                  _U_(4)                                         /**< (DIB_DDEVTYPE) Sub-type Position */
#define DIB_DDEVTYPE_SUB_Msk                  (_U_(0xF) << DIB_DDEVTYPE_SUB_Pos)             /**< (DIB_DDEVTYPE) Sub-type Mask */
#define DIB_DDEVTYPE_SUB(value)               (DIB_DDEVTYPE_SUB_Msk & ((value) << DIB_DDEVTYPE_SUB_Pos))
#define DIB_DDEVTYPE_Msk                      _U_(0x000000FF)                                /**< (DIB_DDEVTYPE) Register Mask  */


/* -------- DIB_DPIDR4 : (DIB Offset: 0x20) ( R/ 32) SCS Peripheral Identification Register 4 -------- */
#define DIB_DPIDR4_DES_2_Pos                  _U_(0)                                         /**< (DIB_DPIDR4) JEP106 continuation code Position */
#define DIB_DPIDR4_DES_2_Msk                  (_U_(0xF) << DIB_DPIDR4_DES_2_Pos)             /**< (DIB_DPIDR4) JEP106 continuation code Mask */
#define DIB_DPIDR4_DES_2(value)               (DIB_DPIDR4_DES_2_Msk & ((value) << DIB_DPIDR4_DES_2_Pos))
#define DIB_DPIDR4_SIZE_Pos                   _U_(4)                                         /**< (DIB_DPIDR4) 4KB count Position */
#define DIB_DPIDR4_SIZE_Msk                   (_U_(0xF) << DIB_DPIDR4_SIZE_Pos)              /**< (DIB_DPIDR4) 4KB count Mask */
#define DIB_DPIDR4_SIZE(value)                (DIB_DPIDR4_SIZE_Msk & ((value) << DIB_DPIDR4_SIZE_Pos))
#define DIB_DPIDR4_Msk                        _U_(0x000000FF)                                /**< (DIB_DPIDR4) Register Mask  */


/* -------- DIB_DPIDR5 : (DIB Offset: 0x24) ( R/ 32) SCS Peripheral Identification Register 5 -------- */
#define DIB_DPIDR5_RESETVALUE               _U_(0x00)                                     /**<  (DIB_DPIDR5) SCS Peripheral Identification Register 5  Reset Value */

#define DIB_DPIDR5_Msk                        _U_(0x00000000)                                /**< (DIB_DPIDR5) Register Mask  */


/* -------- DIB_DPIDR6 : (DIB Offset: 0x28) ( R/ 32) SCS Peripheral Identification Register 6 -------- */
#define DIB_DPIDR6_RESETVALUE               _U_(0x00)                                     /**<  (DIB_DPIDR6) SCS Peripheral Identification Register 6  Reset Value */

#define DIB_DPIDR6_Msk                        _U_(0x00000000)                                /**< (DIB_DPIDR6) Register Mask  */


/* -------- DIB_DPIDR7 : (DIB Offset: 0x2C) ( R/ 32) SCS Peripheral Identification Register 7 -------- */
#define DIB_DPIDR7_RESETVALUE               _U_(0x00)                                     /**<  (DIB_DPIDR7) SCS Peripheral Identification Register 7  Reset Value */

#define DIB_DPIDR7_Msk                        _U_(0x00000000)                                /**< (DIB_DPIDR7) Register Mask  */


/* -------- DIB_DPIDR0 : (DIB Offset: 0x30) ( R/ 32) SCS Peripheral Identification Register 0 -------- */
#define DIB_DPIDR0_PART_0_Pos                 _U_(0)                                         /**< (DIB_DPIDR0) Part number bits[7:0] Position */
#define DIB_DPIDR0_PART_0_Msk                 (_U_(0xFF) << DIB_DPIDR0_PART_0_Pos)           /**< (DIB_DPIDR0) Part number bits[7:0] Mask */
#define DIB_DPIDR0_PART_0(value)              (DIB_DPIDR0_PART_0_Msk & ((value) << DIB_DPIDR0_PART_0_Pos))
#define DIB_DPIDR0_Msk                        _U_(0x000000FF)                                /**< (DIB_DPIDR0) Register Mask  */


/* -------- DIB_DPIDR1 : (DIB Offset: 0x34) ( R/ 32) SCS Peripheral Identification Register 1 -------- */
#define DIB_DPIDR1_PART_1_Pos                 _U_(0)                                         /**< (DIB_DPIDR1) Part number bits[11:8] Position */
#define DIB_DPIDR1_PART_1_Msk                 (_U_(0xF) << DIB_DPIDR1_PART_1_Pos)            /**< (DIB_DPIDR1) Part number bits[11:8] Mask */
#define DIB_DPIDR1_PART_1(value)              (DIB_DPIDR1_PART_1_Msk & ((value) << DIB_DPIDR1_PART_1_Pos))
#define DIB_DPIDR1_DES_0_Pos                  _U_(4)                                         /**< (DIB_DPIDR1) JEP106 identification code bits [3:0] Position */
#define DIB_DPIDR1_DES_0_Msk                  (_U_(0xF) << DIB_DPIDR1_DES_0_Pos)             /**< (DIB_DPIDR1) JEP106 identification code bits [3:0] Mask */
#define DIB_DPIDR1_DES_0(value)               (DIB_DPIDR1_DES_0_Msk & ((value) << DIB_DPIDR1_DES_0_Pos))
#define DIB_DPIDR1_Msk                        _U_(0x000000FF)                                /**< (DIB_DPIDR1) Register Mask  */


/* -------- DIB_DPIDR2 : (DIB Offset: 0x38) ( R/ 32) SCS Peripheral Identification Register 2 -------- */
#define DIB_DPIDR2_DES_1_Pos                  _U_(0)                                         /**< (DIB_DPIDR2) JEP106 identification code bits[6:4] Position */
#define DIB_DPIDR2_DES_1_Msk                  (_U_(0x7) << DIB_DPIDR2_DES_1_Pos)             /**< (DIB_DPIDR2) JEP106 identification code bits[6:4] Mask */
#define DIB_DPIDR2_DES_1(value)               (DIB_DPIDR2_DES_1_Msk & ((value) << DIB_DPIDR2_DES_1_Pos))
#define DIB_DPIDR2_JEDEC_Pos                  _U_(3)                                         /**< (DIB_DPIDR2) JEDEC assignee value is used Position */
#define DIB_DPIDR2_JEDEC_Msk                  (_U_(0x1) << DIB_DPIDR2_JEDEC_Pos)             /**< (DIB_DPIDR2) JEDEC assignee value is used Mask */
#define DIB_DPIDR2_REVISION_Pos               _U_(4)                                         /**< (DIB_DPIDR2) Component revision Position */
#define DIB_DPIDR2_REVISION_Msk               (_U_(0xF) << DIB_DPIDR2_REVISION_Pos)          /**< (DIB_DPIDR2) Component revision Mask */
#define DIB_DPIDR2_REVISION(value)            (DIB_DPIDR2_REVISION_Msk & ((value) << DIB_DPIDR2_REVISION_Pos))
#define DIB_DPIDR2_Msk                        _U_(0x000000FF)                                /**< (DIB_DPIDR2) Register Mask  */


/* -------- DIB_DPIDR3 : (DIB Offset: 0x3C) ( R/ 32) SCS Peripheral Identification Register 3 -------- */
#define DIB_DPIDR3_CMOD_Pos                   _U_(0)                                         /**< (DIB_DPIDR3) Customer Modified Position */
#define DIB_DPIDR3_CMOD_Msk                   (_U_(0xF) << DIB_DPIDR3_CMOD_Pos)              /**< (DIB_DPIDR3) Customer Modified Mask */
#define DIB_DPIDR3_CMOD(value)                (DIB_DPIDR3_CMOD_Msk & ((value) << DIB_DPIDR3_CMOD_Pos))
#define DIB_DPIDR3_REVAND_Pos                 _U_(4)                                         /**< (DIB_DPIDR3) RevAnd Position */
#define DIB_DPIDR3_REVAND_Msk                 (_U_(0xF) << DIB_DPIDR3_REVAND_Pos)            /**< (DIB_DPIDR3) RevAnd Mask */
#define DIB_DPIDR3_REVAND(value)              (DIB_DPIDR3_REVAND_Msk & ((value) << DIB_DPIDR3_REVAND_Pos))
#define DIB_DPIDR3_Msk                        _U_(0x000000FF)                                /**< (DIB_DPIDR3) Register Mask  */


/* -------- DIB_DCIDR0 : (DIB Offset: 0x40) ( R/ 32) SCS Component Identification Register 0 -------- */
#define DIB_DCIDR0_RESETVALUE               _U_(0x0D)                                     /**<  (DIB_DCIDR0) SCS Component Identification Register 0  Reset Value */

#define DIB_DCIDR0_PRMBL_0_Pos                _U_(0)                                         /**< (DIB_DCIDR0) CoreSight component identification preamble Position */
#define DIB_DCIDR0_PRMBL_0_Msk                (_U_(0xFF) << DIB_DCIDR0_PRMBL_0_Pos)          /**< (DIB_DCIDR0) CoreSight component identification preamble Mask */
#define DIB_DCIDR0_PRMBL_0(value)             (DIB_DCIDR0_PRMBL_0_Msk & ((value) << DIB_DCIDR0_PRMBL_0_Pos))
#define DIB_DCIDR0_Msk                        _U_(0x000000FF)                                /**< (DIB_DCIDR0) Register Mask  */


/* -------- DIB_DCIDR1 : (DIB Offset: 0x44) ( R/ 32) SCS Component Identification Register 1 -------- */
#define DIB_DCIDR1_RESETVALUE               _U_(0x90)                                     /**<  (DIB_DCIDR1) SCS Component Identification Register 1  Reset Value */

#define DIB_DCIDR1_PRMBL_1_Pos                _U_(0)                                         /**< (DIB_DCIDR1) CoreSight component identification preamble Position */
#define DIB_DCIDR1_PRMBL_1_Msk                (_U_(0xF) << DIB_DCIDR1_PRMBL_1_Pos)           /**< (DIB_DCIDR1) CoreSight component identification preamble Mask */
#define DIB_DCIDR1_PRMBL_1(value)             (DIB_DCIDR1_PRMBL_1_Msk & ((value) << DIB_DCIDR1_PRMBL_1_Pos))
#define DIB_DCIDR1_CLASS_Pos                  _U_(4)                                         /**< (DIB_DCIDR1) CoreSight component class Position */
#define DIB_DCIDR1_CLASS_Msk                  (_U_(0xF) << DIB_DCIDR1_CLASS_Pos)             /**< (DIB_DCIDR1) CoreSight component class Mask */
#define DIB_DCIDR1_CLASS(value)               (DIB_DCIDR1_CLASS_Msk & ((value) << DIB_DCIDR1_CLASS_Pos))
#define DIB_DCIDR1_Msk                        _U_(0x000000FF)                                /**< (DIB_DCIDR1) Register Mask  */


/* -------- DIB_DCIDR2 : (DIB Offset: 0x48) ( R/ 32) SCS Component Identification Register 2 -------- */
#define DIB_DCIDR2_RESETVALUE               _U_(0x05)                                     /**<  (DIB_DCIDR2) SCS Component Identification Register 2  Reset Value */

#define DIB_DCIDR2_PRMBL_2_Pos                _U_(0)                                         /**< (DIB_DCIDR2) CoreSight component identification preamble Position */
#define DIB_DCIDR2_PRMBL_2_Msk                (_U_(0xFF) << DIB_DCIDR2_PRMBL_2_Pos)          /**< (DIB_DCIDR2) CoreSight component identification preamble Mask */
#define DIB_DCIDR2_PRMBL_2(value)             (DIB_DCIDR2_PRMBL_2_Msk & ((value) << DIB_DCIDR2_PRMBL_2_Pos))
#define DIB_DCIDR2_Msk                        _U_(0x000000FF)                                /**< (DIB_DCIDR2) Register Mask  */


