Microchip-MPLAB-Harmony/csp/apps/dac/dac_wav_gen/firmware/src/packs/ATSAML10E16A_DFP/component/dib.h
/* -------- DIB_DCIDR3 : (DIB Offset: 0x4C) ( R/ 32) SCS Component Identification Register 3 -------- */
#define DIB_DCIDR3_RESETVALUE               _U_(0xB1)                                     /**<  (DIB_DCIDR3) SCS Component Identification Register 3  Reset Value */

#define DIB_DCIDR3_PRMBL_3_Pos                _U_(0)                                         /**< (DIB_DCIDR3) CoreSight component identification preamble Position */
#define DIB_DCIDR3_PRMBL_3_Msk                (_U_(0xFF) << DIB_DCIDR3_PRMBL_3_Pos)          /**< (DIB_DCIDR3) CoreSight component identification preamble Mask */
#define DIB_DCIDR3_PRMBL_3(value)             (DIB_DCIDR3_PRMBL_3_Msk & ((value) << DIB_DCIDR3_PRMBL_3_Pos))
#define DIB_DCIDR3_Msk                        _U_(0x000000FF)                                /**< (DIB_DCIDR3) Register Mask  */


/** \brief DIB register offsets definitions */
#define DIB_DLAR_REG_OFST              (0x00)         /**< (DIB_DLAR) SCS Software Lock Access Register Offset */
#define DIB_DLSR_REG_OFST              (0x04)         /**< (DIB_DLSR) SCS Software Lock Status Register Offset */
#define DIB_DAUTHSTATUS_REG_OFST       (0x08)         /**< (DIB_DAUTHSTATUS) Debug Authentication Status Register Offset */
#define DIB_DDEVARCH_REG_OFST          (0x0C)         /**< (DIB_DDEVARCH) SCS Device Architecture Register Offset */
#define DIB_DDEVTYPE_REG_OFST          (0x1C)         /**< (DIB_DDEVTYPE) SCS Device Type Register Offset */
#define DIB_DPIDR4_REG_OFST            (0x20)         /**< (DIB_DPIDR4) SCS Peripheral Identification Register 4 Offset */
#define DIB_DPIDR5_REG_OFST            (0x24)         /**< (DIB_DPIDR5) SCS Peripheral Identification Register 5 Offset */
#define DIB_DPIDR6_REG_OFST            (0x28)         /**< (DIB_DPIDR6) SCS Peripheral Identification Register 6 Offset */
#define DIB_DPIDR7_REG_OFST            (0x2C)         /**< (DIB_DPIDR7) SCS Peripheral Identification Register 7 Offset */
#define DIB_DPIDR0_REG_OFST            (0x30)         /**< (DIB_DPIDR0) SCS Peripheral Identification Register 0 Offset */
#define DIB_DPIDR1_REG_OFST            (0x34)         /**< (DIB_DPIDR1) SCS Peripheral Identification Register 1 Offset */
#define DIB_DPIDR2_REG_OFST            (0x38)         /**< (DIB_DPIDR2) SCS Peripheral Identification Register 2 Offset */
#define DIB_DPIDR3_REG_OFST            (0x3C)         /**< (DIB_DPIDR3) SCS Peripheral Identification Register 3 Offset */
#define DIB_DCIDR0_REG_OFST            (0x40)         /**< (DIB_DCIDR0) SCS Component Identification Register 0 Offset */
#define DIB_DCIDR1_REG_OFST            (0x44)         /**< (DIB_DCIDR1) SCS Component Identification Register 1 Offset */
#define DIB_DCIDR2_REG_OFST            (0x48)         /**< (DIB_DCIDR2) SCS Component Identification Register 2 Offset */
#define DIB_DCIDR3_REG_OFST            (0x4C)         /**< (DIB_DCIDR3) SCS Component Identification Register 3 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DIB register API structure */
typedef struct
{  /* Debug Identification Block */
  __O   uint32_t                       DIB_DLAR;        /**< Offset: 0x00 ( /W  32) SCS Software Lock Access Register */
  __I   uint32_t                       DIB_DLSR;        /**< Offset: 0x04 (R/   32) SCS Software Lock Status Register */
  __I   uint32_t                       DIB_DAUTHSTATUS; /**< Offset: 0x08 (R/   32) Debug Authentication Status Register */
  __I   uint32_t                       DIB_DDEVARCH;    /**< Offset: 0x0C (R/   32) SCS Device Architecture Register */
  __I   uint8_t                        Reserved1[0x0C];
  __I   uint32_t                       DIB_DDEVTYPE;    /**< Offset: 0x1C (R/   32) SCS Device Type Register */
  __I   uint32_t                       DIB_DPIDR4;      /**< Offset: 0x20 (R/   32) SCS Peripheral Identification Register 4 */
  __I   uint32_t                       DIB_DPIDR5;      /**< Offset: 0x24 (R/   32) SCS Peripheral Identification Register 5 */
  __I   uint32_t                       DIB_DPIDR6;      /**< Offset: 0x28 (R/   32) SCS Peripheral Identification Register 6 */
  __I   uint32_t                       DIB_DPIDR7;      /**< Offset: 0x2C (R/   32) SCS Peripheral Identification Register 7 */
  __I   uint32_t                       DIB_DPIDR0;      /**< Offset: 0x30 (R/   32) SCS Peripheral Identification Register 0 */
  __I   uint32_t                       DIB_DPIDR1;      /**< Offset: 0x34 (R/   32) SCS Peripheral Identification Register 1 */
  __I   uint32_t                       DIB_DPIDR2;      /**< Offset: 0x38 (R/   32) SCS Peripheral Identification Register 2 */
  __I   uint32_t                       DIB_DPIDR3;      /**< Offset: 0x3C (R/   32) SCS Peripheral Identification Register 3 */
  __I   uint32_t                       DIB_DCIDR0;      /**< Offset: 0x40 (R/   32) SCS Component Identification Register 0 */
  __I   uint32_t                       DIB_DCIDR1;      /**< Offset: 0x44 (R/   32) SCS Component Identification Register 1 */
  __I   uint32_t                       DIB_DCIDR2;      /**< Offset: 0x48 (R/   32) SCS Component Identification Register 2 */
  __I   uint32_t                       DIB_DCIDR3;      /**< Offset: 0x4C (R/   32) SCS Component Identification Register 3 */
} dib_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML10_DIB_COMPONENT_H_ */
